In [10]:
import pandas as pd

In [11]:
lista = {'Nome' : ['Carlos', 'Ana', 'Naju', 'Antonio'], 'Idade' : [35, 34, 4, 2], 'Nascimento' : ['01/05/1997', '12/11/1998', '?', '?']}

In [12]:
lista_df = pd.DataFrame(lista)

display(lista_df)

      Nome  Idade  Nascimento
0   Carlos     35  01/05/1997
1      Ana     34  12/11/1998
2     Naju      4           ?
3  Antonio      2           ?